Revit 2027 API
BuiltInFailures.FabricFailures.CoverOffsetTooLong Property
 Cover offset is greater than host thickness.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CoverOffsetTooLong { get; }
Public Shared ReadOnly Property CoverOffsetTooLong As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CoverOffsetTooLong {
	FailureDefinitionId^ get ();
}
static member CoverOffsetTooLong : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FabricFailures Class
Autodesk.Revit.DB Namespace